package dao

import (
	"context"
	"github.com/mangenotwork/common/log"
	"net"
	"strings"
	"time"
	"website-monitor/master/entity"
)

func NsLookUpLocal(host string) *entity.DNSInfo {
	dnsInfo := &entity.DNSInfo{
		DnsServerIP:   "Local",
		DnsServerName: "Local",
		IsCDN:         false,
	}
	start := time.Now().UnixNano()
	ips, err := net.LookupHost(host)
	if err == nil {
		dnsInfo.IPs = ips
	}
	dnsInfo.Ms = float64(time.Now().UnixNano()-start) / 100000
	cname, err := net.LookupCNAME(host)
	if err == nil {
		dnsInfo.LookupCNAME = cname
	}
	if len(dnsInfo.LookupCNAME) > 0 && strings.Index(dnsInfo.LookupCNAME, host) == -1 {
		dnsInfo.IsCDN = true
	}
	return dnsInfo
}

func NsLookUpFromDNSServer(host, dnsServer string) *entity.DNSInfo {
	r := &net.Resolver{
		PreferGo:     true,
		StrictErrors: false,
		Dial: func(ctx context.Context, network, address string) (net.Conn, error) {
			d := net.Dialer{Timeout: time.Millisecond * 1000}
			c, e := d.DialContext(ctx, "udp", dnsServer)
			return c, e
		},
	}
	dnsInfo := &entity.DNSInfo{
		DnsServerIP: dnsServer,
		IsCDN:       false,
	}
	start := time.Now().UnixNano()
	ip, err := r.LookupHost(context.Background(), host)
	if err == nil {
		dnsInfo.IPs = ip
	} else {
		log.Error(dnsServer, " | ", err)
	}
	dnsInfo.Ms = float64(time.Now().UnixNano()-start) / 100000
	cname, err := r.LookupCNAME(context.Background(), host)
	if err == nil {
		dnsInfo.LookupCNAME = cname
	} else {
		log.Error(dnsServer, " | ", err)
	}
	if len(dnsInfo.LookupCNAME) > 0 && strings.Index(dnsInfo.LookupCNAME, host) == -1 {
		dnsInfo.IsCDN = true
	}
	log.Info("获取完成: ", dnsServer)
	return dnsInfo
}

func NsLookUp(host, dnsServer, name string) *entity.DNSInfo {
	log.Info("dnsServer = ", dnsServer)
	r := &net.Resolver{
		PreferGo:     true,
		StrictErrors: false,
		Dial: func(ctx context.Context, network, address string) (net.Conn, error) {
			d := net.Dialer{Timeout: time.Millisecond * 200}
			c, e := d.DialContext(ctx, "udp", dnsServer)
			return c, e
		},
	}
	dnsInfo := &entity.DNSInfo{
		DnsServerIP:   dnsServer,
		DnsServerName: name,
		IsCDN:         false,
	}
	start := time.Now().UnixNano()
	ip, err := r.LookupHost(context.Background(), host)
	if err == nil {
		dnsInfo.IPs = ip
	} else {
		log.Error(dnsServer, " | ", err)
	}
	dnsInfo.Ms = float64(time.Now().UnixNano()-start) / 100000
	cname, err := r.LookupCNAME(context.Background(), host)
	if err == nil {
		dnsInfo.LookupCNAME = cname
	} else {
		log.Error(dnsServer, " | ", err)
	}
	if len(dnsInfo.LookupCNAME) > 0 && strings.Index(dnsInfo.LookupCNAME, host) == -1 {
		dnsInfo.IsCDN = true
	}
	log.Info("获取完成: ", dnsServer)
	return dnsInfo
}

func NsLookUpAll(host string) ([]*entity.DNSInfo, []string) {
	all := make([]*entity.DNSInfo, 0)
	allIPMap := make(map[string]struct{})
	allIP := make([]string, 0)
	results := make(chan *entity.DNSInfo, len(DNSServer))
	for k, v := range DNSServer {
		go func(k, v string) {
			results <- NsLookUp(host, k+":53", v)
		}(k, v)
	}
	for i := 0; i < len(DNSServer); i++ {
		res := <-results
		all = append(all, res)
	}
	for _, v := range all {
		for _, i := range v.IPs {
			allIPMap[i] = struct{}{}
		}
	}
	for k, _ := range allIPMap {
		allIP = append(allIP, k)
	}
	return all, allIP
}

// DNSServer DNS服务器地址大全  ip:服务商
var DNSServer = map[string]string{
	"114.114.114.114": "公共DNS|114DNS",
	"114.114.115.115": "公共DNS|114DNS",
	//"119.29.29.29":    "公共DNS|DNSPod DNS+",
	// "182.254.116.116": "公共DNS|DNSPod DNS+",
	"101.226.4.6":   "公共DNS|DNS 派 电信/移动/铁通",
	"218.30.118.6":  "公共DNS|DNS 派 电信/移动/铁通",
	"123.125.81.6":  "公共DNS|DNS DNS 派 联通",
	"140.207.198.6": "公共DNS|DNS DNS 派 联通",
	//"1.2.4.8":       "公共DNS|cnnicDNS",
	//"210.2.4.8":     "公共DNS|cnnicDNS",
	"8.8.8.8": "公共DNS|GoogleDNS",
	//"8.8.4.4":       "公共DNS|GoogleDNS",
	//"1.1.1.1":       "公共DNS|CloudflareDNS",
	//"1.0.0.1":       "公共DNS|CloudflareDNS",
	//"9.9.9.9": "公共DNS|IBM Quad9DNS",
	// "185.222.222.222": "公共DNS|DNS.SB",
	//"185.184.222.222": "公共DNS|DNS.SB",
	//"208.67.222.222": "公共DNS|OpenDNS",
	//"208.67.220.220": "公共DNS|OpenDNS",
	// "199.91.73.222":   "公共DNS|V2EXDNS",
	// "178.79.131.110":  "公共DNS|V2EXDNS",
	"223.5.5.5": "公共DNS|阿里云DNS",
	"223.6.6.6": "公共DNS|阿里云DNS",
	//"183.60.83.19": "公共DNS|腾讯云DNS",
	//"183.60.82.98":    "公共DNS|腾讯云DNS",
	"180.76.76.76": "公共DNS|百度云DNS",
	"4.2.2.1":      "公共DNS|微软云DNS",
	//"4.2.2.2":         "公共DNS|微软云DNS",
	"122.112.208.1":   "公共DNS|华为云DNS",
	"139.9.23.90":     "公共DNS|华为云DNS",
	"114.115.192.11":  "公共DNS|华为云DNS",
	"116.205.5.1":     "公共DNS|华为云DNS",
	"116.205.5.30":    "公共DNS|华为云DNS",
	"122.112.208.175": "公共DNS|华为云DNS",
	"139.159.208.206": "公共DNS|华为云DNS",
	"180.184.1.1":     "公共DNS|字节跳动",
	"180.184.2.2":     "公共DNS|字节跳动",
	"168.95.192.1":    "公共DNS|中華電信DNS",
	//"168.95.1.1":      "公共DNS|中華電信DNS",
	//"203.80.96.10":    "公共DNS|香港宽频DNS",
	// "203.80.96.9":     "公共DNS|香港宽频DNS",
	//"199.85.126.10": "公共DNS|赛门铁克诺顿DNS",
	//"199.85.127.10": "公共DNS|赛门铁克诺顿DNS",
	//"216.146.35.35": "公共DNS|oracle+dynDNS",
	//"216.146.36.36":  "公共DNS|oracle+dynDNS",
	//"64.6.64.6":      "公共DNS|瑞士瑞信银行DNS",
	//"64.6.65.6":      "公共DNS|瑞士瑞信银行DNS",
	"61.132.163.68":  "电信|安徽",
	"202.102.213.68": "电信|安徽",
	//"219.141.136.10": "电信|北京",
	//"219.141.140.10": "电信|北京",
	//"61.128.192.68":   "电信|重庆",
	// "61.128.128.68": "电信|重庆",
	// "218.85.152.99": "电信|福建",
	// "218.85.157.99":   "电信|福建",
	// "202.100.64.68":  "电信|甘肃",
	//"61.178.0.93": "电信|甘肃",
	//"202.96.128.86":  "电信|广东",
	// "202.96.128.166": "电信|广东",
	//"202.96.134.133": "电信|广东",
	//"202.96.128.68": "电信|广东",
	// "202.103.225.68": "电信|广西",
	// "202.103.224.68":  "电信|广西",
	"202.98.192.67":  "电信|贵州",
	"202.98.198.167": "电信|贵州",
	// "222.88.88.88":    "电信|河南",
	// "222.85.85.85":    "电信|河南",
	// "219.147.198.230": "电信|黑龙江",
	// "219.147.198.242": "电信|黑龙江",
	// "202.103.24.68":   "电信|湖北",
	//"202.103.0.68": "电信|湖北",
	// "59.51.78.211":    "电信|湖南",
	// "59.51.78.210":   "电信|湖南",
	//"222.246.129.80": "电信|湖南",
	// "218.2.2.2":       "电信|江苏",
	// "218.4.4.4":   "电信|江苏",
	// "61.147.37.1": "电信|江苏",
	// "218.2.135.1":    "电信|江苏",
	"202.101.224.69": "电信|江西",
	// "202.101.226.68": "电信|江西",
	// "219.148.162.31":  "电信|内蒙古",
	// "222.74.39.50": "电信|内蒙古",
	// "219.146.1.66": "电信|山东",
	// "219.147.1.66":    "电信|山东",
	//"218.30.19.40": "电信|陕西",
	// "61.134.1.4":      "电信|陕西",
	//"202.96.209.133": "电信|上海",
	// "116.228.111.118": "电信|上海",
	// "202.96.209.5":    "电信|上海",
	//"180.168.255.118": "电信|上海",
	"61.139.2.69":   "电信|四川",
	"218.6.200.139": "电信|四川",
	// "219.150.32.132":  "电信|天津",
	// "219.146.0.132":   "电信|天津",
	// "222.172.200.68": "电信|云南",
	// "61.166.150.123": "电信|云南",
	// "202.101.172.35": "电信|浙江",
	// "61.153.177.196": "电信|浙江",
	// "61.153.81.75":   "电信|浙江",
	// "60.191.244.5":    "电信|浙江",
	// "123.123.123.123": "联通|北京",
	//"123.123.123.124": "联通|北京",
	//"202.106.0.20": "联通|北京",
	//"202.106.195.68": "联通|北京",
	// "221.5.203.98":    "联通|重庆",
	//"221.7.92.98":  "联通|重庆",
	//"210.21.196.6": "联通|广东",
	// "221.5.88.88":     "联通|广东",
	// "202.99.160.68": "联通|河北",
	//"202.99.166.4": "联通|河北",
	// "202.102.224.68": "联通|河南",
	// "202.102.227.68": "联通|河南",
	// "202.97.224.69":  "联通|黑龙江",
	// "202.97.224.68": "联通|黑龙江",
	// "202.98.0.68": "联通|吉林",
	// "202.98.5.68": "联通|吉林",
	// "221.6.4.66":  "联通|江苏",
	// "221.6.4.67":    "联通|江苏",
	//"202.99.224.68": "联通|内蒙古",
	// "202.99.224.8":   "联通|内蒙古",
	// "202.102.128.68": "联通|山东",
	//"202.102.152.3":  "联通|山东",
	//"202.102.134.68": "联通|山东",
	//"202.102.154.3":  "联通|山东",
	// "202.99.192.66":  "联通|山西",
	// "202.99.192.68": "联通|山西",
	// "221.11.1.67":     "联通|陕西",
	// "221.11.1.68": "联通|陕西",
	//"210.22.70.3": "联通|上海",
	//"210.22.84.3": "联通|上海",
	// "119.6.6.6":      "联通|四川",
	//"124.161.87.155": "联通|四川",
	// "202.99.104.68":  "联通|天津",
	// "202.99.96.68": "联通|天津",
	// "221.12.1.227": "联通|浙江",
	// "221.12.33.227":  "联通|浙江",
	// "202.96.69.38":    "联通|辽宁",
	// "202.96.64.68":  "联通|辽宁",
	//"211.138.180.2": "移动|安徽",
	// "211.138.180.3":  "移动|安徽",
	// "218.201.96.130": "移动|山东",
	//"211.137.191.26": "移动|山东",
	//"218.201.124.18": "移动|山东",
	//"218.201.124.19": "移动|山东",
	//"211.138.106.2": "移动|山西",
	//"211.138.106.3":  "移动|山西",
	// "211.138.106.18":  "移动|山西",
	//"211.138.106.19": "移动|山西",
	// "211.138.106.7":  "移动|山西",
	//"221.131.143.69": "移动|江苏",
	//"112.4.0.55":     "移动|江苏",
	//"221.130.13.133": "移动|江苏",
	// "211.103.55.50":  "移动|江苏",
	// "221.130.56.241":  "移动|江苏",
	// "211.140.13.188":  "移动|浙江",
	// "211.140.188.188": "移动|浙江",
	//"211.140.10.2": "移动|浙江",
	// "211.142.210.98": "移动|湖南",
	// "211.142.210.99":  "移动|湖南",
	// "211.142.210.100": "移动|湖南",
	//"211.142.210.101": "移动|湖南",
	//"211.142.236.87":  "移动|湖南",
	// "211.137.58.20":   "移动|湖北",
	// "211.137.64.163": "移动|湖北",
	// "211.136.17.107": "移动|湖北",
	// "211.136.20.203": "移动|湖北",
	//"211.141.90.68": "移动|江西",
	// "211.141.90.69": "移动|江西",
	//"211.141.85.68": "移动|江西",
	// "211.137.130.3":  "移动|陕西",
	// "211.137.130.19": "移动|陕西",
	// "218.200.6.139":  "移动|陕西",
	// "211.137.82.4": "移动|四川",
	// "218.201.4.3":  "移动|重庆",
	// "218.201.21.132":  "移动|重庆",
	// "218.201.17.2": "移动|重庆",
	// "221.130.33.52": "移动|北京",
	// "221.130.33.60": "移动|北京",
	// "211.136.28.231": "移动|北京",
	// "211.136.28.234": "移动|北京",
	//"211.136.28.237": "移动|北京",
	// "211.136.28.228": "移动|北京",
	// "211.137.160.50": "移动|天津",
	// "211.137.160.185": "移动|天津",
	// "211.136.112.50": "移动|上海",
	// "211.136.150.66": "移动|上海",
	// "211.136.192.6": "移动|广东",
	// "211.136.20.204": "移动|广东",
	// "211.139.163.6":   "移动|广东",
	//"211.139.136.68": "移动|广东",
	//"211.136.18.171":  "移动|广东",
	//"211.138.245.180": "移动|广西",
	// "211.136.17.108":  "移动|广西",
	//"211.139.5.29": "移动|贵州",
	// "211.139.5.30":    "移动|贵州",
	//"211.138.151.161": "移动|福建",
	//"211.138.156.66": "移动|福建",
	// "218.207.217.241": "移动|福建",
	//"218.207.217.242": "移动|福建",
	// "211.143.181.178": "移动|福建",
	// "211.143.60.56":   "移动|河北",s
	//"211.138.13.66":   "移动|河北",
	//"218.203.160.194": "移动|甘肃",
	// "218.203.160.195": "移动|甘肃",
	// "211.137.241.34":  "移动|黑龙江",
	//"211.137.241.35": "移动|黑龙江",
	// "211.141.16.99":  "移动|吉林",
	//"211.141.0.99":   "移动|吉林",
	//"211.137.32.178": "移动|辽宁",
	// "211.140.197.58":  "移动|辽宁",
	// "211.139.29.68":   "移动|云南",
	//"211.139.29.69":  "移动|云南",
	// "211.139.29.150": "移动|云南",
	//"211.139.29.170": "移动|云南",
	//"218.202.1.166":  "移动|云南",
	// "221.176.88.95":   "移动|海南",
	//"211.138.164.6": "移动|海南",
	// "211.138.91.1":  "移动|内蒙古",
	// "211.138.91.2":    "移动|内蒙古",
	//"218.202.152.130": "移动|新疆",
	//"218.202.152.131": "移动|新疆",
	//"211.139.73.34": "移动|西藏",
	// "211.139.73.35":   "移动|西藏",
	// "211.138.75.123":  "移动|青海",
	//"203.142.100.18": "移动|香港",
	//"203.142.100.21": "移动|香港",
	// "61.235.70.252":  "铁通|广东",
	// "211.98.4.1":    "铁通|广东",
	//"116.199.0.200": "广电|广东",
	// "116.116.116.1": "广电|广东",
	//"211.162.78.1": "长城宽带|广东",
	// "211.162.78.2":  "长城宽带|广东",
	// "211.148.192.141": "天威视讯|广东",
	//"211.139.5.29":    "贵州贵阳移动",
	//"211.139.80.6": "甘肃兰州移动",
	//"221.13.30.242":   "贵州贵阳联通",
	//"218.201.4.3":     "重庆重庆移动",
	//"218.203.123.116": "宁夏回族自治区银川移动",
	//"211.141.85.68":   "江西南昌移动",
	//"211.138.75.123":  "青海西宁移动",
	//"111.11.1.1":      "河北石家庄移动",
	//"211.140.13.188": "浙江台州移动",
	//"211.139.73.50":   "西藏自治区拉萨移动",
	//"183.221.253.100": "四川成都移动",
	//"211.136.192.6": "广东深圳移动",
	//"211.137.130.3": "陕西西安移动",
	//"211.138.164.6":   "海南海口移动",
	// "211.136.112.50":  "上海上海移动",
	//"211.141.0.99": "吉林长春移动",
	//"211.137.32.178":  "辽宁大连移动",
	//"211.142.211.124": "湖南长沙移动",
	//"211.138.180.3":   "安徽合肥移动",
	//"211.138.240.100": "广西壮族自治区南宁移动",
	// "211.140.188.188": "浙江杭州移动",
	//"211.138.106.2":   "山西太原移动",
	//"211.138.151.161": "福建厦门移动",
	//"218.202.152.130": "新疆维吾尔自治区乌鲁木齐移动",
	//"211.138.24.66":  "河南郑州移动",
	//"218.203.59.116": "黑龙江哈尔滨移动",
	//"211.138.91.2":   "内蒙古自治区呼和浩特移动",
	//"218.201.96.130": "山东济南移动",
	//"112.4.0.55": "江苏南京移动",
	//"221.179.155.209": "北京北京移动",
	//"211.139.29.150":  "云南昆明移动",
	//"120.196.165.24": "广东广州移动",
	//"202.100.64.68":  "甘肃兰州电信",
	//"221.7.34.11": "甘肃兰州联通",
	//"211.137.64.163": "湖北襄阳移动",
	//"61.128.128.68":   "重庆重庆电信",
	//"219.150.32.132": "天津天津电信",
	//"202.101.226.68":  "江西南昌电信",
	//"222.222.202.202": "河北石家庄电信",
	//"60.191.134.196":  "浙江台州电信",
	"202.98.96.68": "电信|四川成都",
	//"202.96.128.86": "广东深圳电信",
	//"218.30.19.40": "陕西西安电信",
	//"61.177.7.1":    "江苏无锡电信",
	//"202.100.192.68": "海南海口电信",
	//"202.96.199.133": "上海上海电信",
	//"219.148.204.66": "辽宁大连电信",
	//"218.85.152.99": "福建福州电信",
	//"59.51.78.211":   "湖南长沙电信",
	//"202.103.44.150": "湖北武汉电信",
	"202.102.192.68": "电信|安徽合肥",
	//"219.149.194.56": "吉林通化电信",
	//"202.103.225.68": "广西壮族自治区南宁电信",
	//"202.101.172.35": "浙江杭州电信",
	//"59.49.49.49": "山西太原电信",
	//"219.146.1.66":   "山东青岛电信",
	//"61.128.114.134": "新疆维吾尔自治区乌鲁木齐电信",
	//"222.85.85.85":   "河南郑州电信",
	//"222.74.1.200": "内蒙古自治区呼和浩特电信",
	//"219.141.140.10": "北京北京电信",
	//"222.172.200.68": "云南昆明电信",
	//"202.96.134.133": "广东广州电信",
	//"221.7.92.98": "重庆重庆联通",
	//"221.199.12.158": "宁夏回族自治区银川联通",
	//"202.99.96.68":   "天津天津联通",
	//"220.248.192.13": "江西南昌联通",
	//"221.7.136.68":   "广西壮族自治区柳州联通",
	//"202.99.160.68":  "河北石家庄联通",
	//"221.12.65.227":  "浙江台州联通",
	//"221.13.65.35": "西藏自治区拉萨联通",
	//"119.6.6.6":    "四川成都联通",
	//"210.21.196.6": "广东深圳联通",
	//"124.89.1.129": "陕西西安联通",
	//"221.11.132.2": "海南海口联通",
	//"210.22.84.3":  "上海上海联通",
	//"202.96.64.68": "辽宁大连联通",
	//"58.20.127.170":   "湖南长沙联通",
	//"218.106.127.122": "湖北武汉联通",
	//"218.104.78.2":    "安徽合肥联通",
	//"202.99.192.68":   "山西太原联通",
	//"202.102.128.68":  "山东青岛联通",
	//"218.104.128.106": "福建厦门联通",
	"221.7.1.21": "联通|新疆维吾尔自治区乌鲁木齐",
	//"202.98.0.68":     "吉林吉林联通",
	//"202.102.224.68":  "河南郑州联通",
	//"202.97.224.69": "黑龙江哈尔滨联通",
	//"202.99.224.67":  "内蒙古自治区呼和浩特联通",
	//"58.240.57.33":   "江苏南京联通",
	"202.106.46.151": "联通|北京",
	//"221.3.131.12":   "云南昆明联通",
	//"58.242.2.2":      "安徽芜湖联通",
	//"100.100.2.138": "四川成都阿里巴巴",
	//"100.100.2.136": "广东深圳阿里巴巴",
	//"172.31.0.2": "香港特别行政区香港特别行政区亚马逊",
	//"169.254.169.254": "香港特别行政区香港特别行政区谷歌",
	//"168.63.129.16": "香港特别行政区香港特别行政区微软",
}
